dotfiles/init.org
* Straight.el 
#+BEGIN_SRC emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
  (straight-use-package 'use-package)
#+END_SRC
* Ui  
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'doom-themes)
  (load-theme 'doom-tokyo-night t)

  (straight-use-package 'doom-modeline)
  (doom-modeline-mode 1)


  (straight-use-package 'all-the-icons)
  (setq doom-modeline-major-mode-icon t)

  (use-package all-the-icons
  :if (display-graphic-p))

  (add-to-list 'custom-theme-load-path "~/.emacs.d/themes/") ;; My Themes directory  
  (menu-bar-mode -1)
  (toggle-scroll-bar -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)

  (setq display-line-numbers-type 'relative)
  (solaire-global-mode +1)
  (set-frame-font "Inconsolata 12" nil t)
#+END_SRC
* Packages
** Dap/Lsp mode
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'lsp-mode)
  (straight-use-package 'dap-mode)
#+END_SRC
*** Type-script setup
#+BEGIN_SRC emacs-lisp
   ;(use-package typescript-mode
   ;:mode "\\.ts\\'"
   ;:hook(typescript-mode . lsp-deferred)
   ;:config
   ;(setq typescript-indent-level 2))
#+END_SRC   
*** Haskell setup/Nix Haskell
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'haskell-mode)
#+END_SRC   
*** Anisible/Yml setup
 #+BEGIN_SRC emacs-lisp
   (straight-use-package 'ansible)
   (straight-use-package 'yaml-mode)
   (add-hook 'yaml-mode-hook '(lambda () (ansible 1)))
 #+END_SRC

*** Nix setup
 #+BEGIN_SRC emacs-lisp
   (straight-use-package 'nix-mode)
 #+END_SRC

*** React mode 
    #+begin_src emacs-lisp
    (with-eval-after-load 'lsp-mode
    (require 'dap-chrome)
    (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)
    (yas-global-mode))
    #+end_src
** Company mode 
#+BEGIN_SRC emacs-lisp
   (straight-use-package 'company-mode)
#+END_SRC
** Evil mode
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'evil)
  (straight-use-package 'evil-org-mode)
  (setq evil-want-C-u-scroll t)
  (evil-mode 1)
  (evil-org-mode 1)
#+END_SRC
** Org Mode 
#+BEGIN_SRC emacs-lisp
  ;(straight-use-package 'org-mode)
   (add-hook 'org-mode 'display-line-numbers-mode 1)
#+END_SRC
** Vertico mode
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'vertico)
  (vertico-mode 1)
#+END_SRC
** Treemacs
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'treemacs
  (treemacs-load-theme 'all-the-icons)
  (treemacs-set-width  '25))

  (straight-use-package 'treemacs-evil)
  (straight-use-package 'treemacs-magit)
  (straight-use-package 'treemacs-all-the-icons)
  (global-set-key [f8] 'treemacs)
  (use-package treemacs-all-the-icons
     :after treemacs)
  ;(treemacs-load-theme 'all-the-icons)
  ;(treemacs-set-width  '25)
#+END_SRC
** Magit
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'magit)
#+END_SRC
** Helpful mode
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'helpful)
  (global-set-key (kbd "C-h f") #'helpful-callable)
  (global-set-key (kbd "C-h v") #'helpful-variable)
  (global-set-key (kbd "C-h k") #'helpful-key)
#+END_SRC
** Which key mode
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'which-key)
  (which-key-mode 1)
#+END_SRC
** Solaire-mode
    #+begin_src emacs-lisp
    (straight-use-package 'solaire-mode)
    #+end_src

* Melpa
#+BEGIN_SRC emacs-lisp
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org"."https://orgmode.org/elpa/")
			   ("elpa"."https://melpa.org/packages/")))
#+END_SRC
